Repository: PeterOmbodi/caesar-s_calendar
Catalog: lib/l10n/intl_*.arb
Languages: uk

source: Additional
uk: Додатково

# appTitle
source: Caesar's calendar
uk: Календар Цезаря

source: Auto lock config
uk: Автоблокування конфігурації

# autoLockConfigDescription
source: Lock configuration on first move
uk: Блокувати конфігурацію після першого ходу

# borderConfig
source: App moves highlighting
uk: Підсвічування ходів застосунку

# borderConfigDescription
source: Use a contrasting border color for app moves
uk: Використовувати контрастний колір рамки для ходів застосунку

source: Check solvability
uk: Перевірити розв'язність

source: Dark
uk: Темна

source: Hide controls
uk: Сховати елементи керування

# hint
source: Single piece hint
uk: Підказка для однієї фігури

# howToPlayTitle
source: How to Play
uk: Як грати

# howToPlayGoalTitle
source: Goal
uk: Мета

# howToPlayGoalDescription
source: Place all puzzle pieces on the board so that exactly two cells remain free - the ones corresponding to the current month and current day.
uk: Розклади всі деталі на полі так, щоб рівно дві клітинки залишилися вільними — ті, що відповідають поточному місяцю і дню.

# howToPlayGoalDailyChange
source: Every day the target cells change, creating a new unique challenge. Move the predefined blocks to reshape the board when you want extra variety.
uk: Щодня цільові клітинки змінюються, створюючи нове унікальне випробування. Переставляй задані блоки, щоб урізноманітнити поле.

# howToPlayBasicsTitle
source: Basics
uk: Основи

# howToPlayStepDrag
source: Drag & Drop pieces onto the board.
uk: Перетягуй деталі на поле.

# howToPlayStepRotate
source: Rotate pieces with a single tap/click.
uk: Обертай деталі одним тапом/кліком.

# howToPlayStepFlip
source: Flip pieces with a double tap/click.
uk: Віддзеркалюй деталі подвійним тапом/кліком.

# howToPlayControlsTitle
source: Controls & buttons
uk: Керування та кнопки

# howToPlayMenuTitle
source: Menu
uk: Меню

# howToPlayMenuDescription
source: Open menu panel
uk: Відкрити панель меню

# howToPlaySolveTitle
source: Solve
uk: Розв'язати

# howToPlaySolveDescription
source: Shows the automatic solution for the current layout.
uk: Показує автоматичне рішення для поточного розташування.

# howToPlayHintTitle
source: Hint
uk: Підказка

# howToPlayHintDescription
source: Reveals one move for a random piece.
uk: Відкриває один хід для випадкової фігури.

# howToPlayUndoTitle
source: Undo
uk: Скасувати

# howToPlayUndoDescription
source: Reverts your last action.
uk: Повертає попередню дію.

# howToPlayRedoTitle
source: Redo
uk: Повторити

# howToPlayRedoDescription
source: Repeats the last reverted action.
uk: Повторює останню скасовану дію.

# howToPlayResetTitle
source: Reset
uk: Скинути

# howToPlayResetDescription
source: Returns the puzzle to its initial state.
uk: Повертає головоломку до початкового стану.

# howToPlaySettingsTitle
source: Settings & indicators
uk: Налаштування та індикатори

# howToPlaySettingsPanelTitle
source: Settings panel
uk: Панель налаштувань

# howToPlaySettingsPanelDescription
source: Switch theme, lock/unlock the configuration, toggle overlapping and snapping, highlight pieces when a hint is shown, display solvability status, show the number of possible solutions, and track solving time.
uk: Змінюй тему, блокуй/розблоковуй конфігурацію, вмикай заборону перекриття та прив'язку до сітки, підсвічуй фігури під час підказки, показуй розв'язуваність, кількість можливих рішень і час вирішення.

# howToPlaySolvableTitle
source: Solvable layout
uk: Розв'язувана конфігурація

# howToPlaySolvableDescription
source: Green indicator appears when the current configuration has at least one solution.
uk: Зелений індикатор з'являється, коли поточне розташування має хоча б одне рішення.

# howToPlayUnsolvableTitle
source: Unsolvable layout
uk: Нерозв'язувана конфігурація

# howToPlayUnsolvableDescription
source: Red indicator warns that the current configuration has no solutions.
uk: Червоний індикатор попереджає, що для поточного розташування немає рішень.

source: Light
uk: Світла

# lockConfig
source: Lock configuration
uk: Заблокувати конфігурацію

source: Next solution
uk: Наступне рішення

# prevSolution
source: Previous solution
uk: Попереднє рішення

source: Prevent overlapping
uk: Запобігати перекриття

# preventOverlappingDescription
source: Allow drag-and-drop only onto empty grid cells
uk: Дозволити розташування тільки на вільних клітинах сітки

source: Redo
uk: Повторити

source: Reset
uk: Скинути

# searchCompletedDialogTitle
source: Search completed
uk: Пошук завершено

source: Search solution
uk: Знайти рішення

source: Settings
uk: Налаштування

source: Show controls
uk: Показати елементи керування

source: Snap to Grid
uk: Прив’язка до сітки

# snapToGridDescription
source: Keep pieces inside the grid when rotating or flipping
uk: Утримувати фігури в межах сітки під час обертання або віддзеркалення

source: Solvability
uk: Розв’язуваність

# solvedAlertTitle
source: Congrats! 🎉
uk: Вітаю! 🎉

# solvedAlertSubTitle
source: You completed the puzzle!
uk: Ти зробив це!

# solutionShort
source: Sol
uk: Ріш

# solutionLabel
source: solution: {current} / {total}
uk: рішення: {current} / {total}

# solutionIndicatorCountTitle
source: Solution counter
uk: Лічильник розв’язків

# solutionIndicatorCountSubtitle
source: Shows how many different solutions exist for this puzzle state
uk: Показує, скільки різних розв’язків існує для цього стану головоломки

# solutionIndicatorHiddenTitle
source: Hidden mode
uk: Прихований режим

# solutionIndicatorHiddenSubtitle
source: Reveal solvability info only when asking for a hint or solution
uk: Показувати інформацію про розв’язуваність лише під час запиту підказки або розв’язку

# solutionIndicatorSolvabilityTitle
source: Solvability indicator
uk: Індикатор розв’язуваності

# solutionIndicatorSolvabilitySubtitle
source: Shows whether the current setup can be solved
uk: Показує, чи можна розв’язати поточну конфігурацію

# solutionsFoundDialogCancel
source: Cancel
uk: Скасувати

# solutionsFoundDialogMessage
source: Found {count} solutions. Show them?
uk: Знайдено {count} рішень. Показати?

# solutionsFoundDialogOk
source: Show
uk: Показати

# solutionsNotFoundDialogMessage
source: No solutions found for the given configuration
uk: Не знайдено рішень для заданої конфігурації

source: Switch theme
uk: Переключити тему

source: System
uk: Системна

source: Time
uk: Час

# timerToggleTitle
source: Solving timer
uk: Таймер

# timerToggleSubtitle
source: Show total time from first move to solution
uk: Показувати час використаний на пошук рішення

source: Theme
uk: Тема

source: Undo
uk: Скасувати

# unlockConfig
source: Unlock configuration
uk: Розблокувати конфігурацію

# unlockConfigDescription
source: Drag & rotate predefined blocks to build your custom layout
uk: Створюйте власну конфігурацію перетягуючи/обертаючи передвстановленні блоки

source: General
uk: Загальні
